In [65]:
from math import sqrt
from scipy import stats
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from pydataset import data
import statistics
import seaborn as sns
import env

## In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [66]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'taxis', 'tips', 'titanic']

In [67]:
iris = sns.load_dataset('iris')

In [68]:
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [69]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [70]:
iris.shape

(150, 5)

In [71]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [73]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

## Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

Make sure that the spreadsheet is publicly visible under your sharing settings.

In [38]:
url = 'https://docs.google.com/spreadsheets/d/19caGgO_ddhVl2ZIvxQHB0BTknMUOYctsahaQd_YNiTM/edit?usp=sharing'

In [39]:
# replace /edit with /export?format=csv

In [40]:
url = 'https://docs.google.com/spreadsheets/d/19caGgO_ddhVl2ZIvxQHB0BTknMUOYctsahaQd_YNiTM/export?format=csv'

In [41]:
pd.read_csv(url)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,has_phone,internet_service,has_internet,has_phone_and_internet,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,True,1,True,True,1,Mailed check,65.60,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,True,1,True,True,0,Mailed check,59.90,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,True,2,True,True,0,Electronic check,73.90,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,True,2,True,True,0,Electronic check,98.00,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,True,2,True,True,0,Mailed check,83.90,267.40,Yes,3.187128
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7044,9987-LUTYD,Female,0,No,No,1,True,1,True,True,1,Mailed check,55.15,742.90,No,13.470535
7045,9992-RRAMN,Male,0,Yes,No,2,True,2,True,True,0,Electronic check,85.10,1873.70,Yes,22.017626
7046,9992-UJOEL,Male,0,No,No,1,True,1,True,True,0,Mailed check,50.30,92.75,No,1.843936
7047,9993-LHIEB,Male,0,Yes,Yes,1,True,1,True,True,2,Mailed check,67.85,4627.65,No,68.204127
7048,9995-HOTOH,Male,0,Yes,Yes,0,False,1,True,False,2,Electronic check,59.00,3707.60,No,62.840678

In [42]:
url = 'https://docs.google.com/spreadsheets/d/1qyreW29fvdvr8IIh23p0LyV2eL-kPs2v8tJf5-03k1s/edit#gid=1023018493'
# replace /edit with /export?format=csv
url = 'https://docs.google.com/spreadsheets/d/1qyreW29fvdvr8IIh23p0LyV2eL-kPs2v8tJf5-03k1s/export?format=csv#gid=1023018493'
# make sure it's public
df_google_sheets = pd.read_csv(url)

### assign the first 100 rows to a new dataframe, df_google_sheets_sample

In [43]:
df_google_sheets_sample = df_google_sheets.head(100)

### print the number of rows of your original dataframe

In [44]:
df_google_sheets.shape

(7049, 12)

### print the first 5 column names

In [49]:
df_google_sheets.columns.tolist()

['customer_id',
 'gender',
 'is_senior_citizen',
 'partner',
 'dependents',
 'phone_service',
 'internet_service',
 'contract_type',
 'payment_type',
 'monthly_charges',
 'total_charges',
 'churn']

### print the column names that have a data type of object, select_dtypes will filter out the datatype that I want.

In [75]:
list(df_google_sheets.select_dtypes('object'))

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

### compute the range for each of the numeric variables.

In [50]:
df_google_sheets.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000

## Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

In [26]:
df_excel = pd.read_excel('Copy of innis_spreadsheet_exercises.xlsx',
              sheet_name='Table1_CustDetails')

### assign the first 100 rows to a new dataframe, df_excel_sample

In [27]:
df_excel_sample = df_excel.head(100)

### print the number of rows of your original dataframe

In [28]:
df_excel.shape

(7049, 16)

### print the first 5 column names

In [34]:
df_excel.columns

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents',
       'phone_service', 'has_phone', 'internet_service', 'has_internet',
       'has_phone_and_internet', 'contract_type', 'payment_type',
       'monthly_charges', 'total_charges', 'churn', 'tenure'],
      dtype='object')

### print the column names that have a data type of object

In [35]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             7049 non-null   object
 1   gender                  7049 non-null   object
 2   is_senior_citizen       7049 non-null   float64
 3   partner                 7049 non-null   object
 4   dependents              7049 non-null   object
 5   phone_service           7049 non-null   float64
 6   has_phone               7049 non-null   bool
 7   internet_service        7049 non-null   float64
 8   has_internet            7049 non-null   bool
 9   has_phone_and_internet  7049 non-null   bool
 10  contract_type           7049 non-null   float64
 11  payment_type            7049 non-null   object
 12  monthly_charges         7049 non-null   float64
 13  total_charges           7038 non-null   float64
 14  churn                   7049 non-null   object
 15  tenure                  7049 non-null   float64
dtypes: bool(3), float64(7), object(6)
memory usage: 736.7+ KB

### compute the range for each of the numeric variables.
Need to use apply function to every column, Number will get all interger or float, board selection. col here refer to each col

In [78]:
df_google_sheets.select_dtypes('number').apply(lambda col: col.max() - col.min())

PassengerId    890.0000
Survived         1.0000
Pclass           2.0000
Age             79.5800
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

## Read the data from this google sheet into a dataframe, df_google.

print the first 3 rows

In [52]:
url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/export?format=csv#gid=341089357'

In [54]:
df_google = pd.read_csv(url)

In [55]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [56]:
df_google.shape

(891, 12)

In [57]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [58]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [59]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [62]:
df_google_sample = df_google.sample(100)

In [79]:
df_google.select_dtypes('object').apply(lambda col: col.unique().tolist())

Name        [Braund, Mr. Owen Harris, Cumings, Mrs. John Bradley (Florence Briggs Thayer), Heikkin...
Sex                                                                                    [male, female]
Ticket      [A/5 21171, PC 17599, STON/O2. 3101282, 113803, 373450, 330877, 17463, 349909, 347742,...
Cabin       [nan, C85, C123, E46, G6, C103, D56, A6, C23 C25 C27, B78, D33, B30, C52, B28, C83, F3...
Embarked                                                                               [S, C, Q, nan]
dtype: object